<template>
  <div class="delivery">
    <BreadcrumbContainer v-if="!isTablet">
      <Breadcrumb :links-list="$route.meta.tableBreadCrumb" />
    </BreadcrumbContainer>
    <div class="flex aifs">
      <div class="delivery__content round-block">
        <h3 class="delivery__header tac">Доставка и оплата</h3>
        <p>
          В этом разделе сайта рассказывается, как купить понравившуюся куклу и,
          наконец, заполучить ее в руки! Интернет-магазин Империя Кидс
          доставляет куклы и аксессуары по России, Украине, Белоруссии и
          Казахстану!
          <br /><br />
          Цена доставки по
          <br /><br />
          Москве (в пределах МКАД) - 300 руб (при заказе от 10 000 руб. доставка
          в пределах МКАД бесплатная),
          <br /><br />
          В пределах 7 км от МКАД - 450 руб (от 10 000 руб. стоимость доставки
          всего 199 руб.) + 30 рублей каждый последующий километр,
          <br /><br />
          Санкт-Петербургу - 300 руб,
          <br /><br />
          Екатеринбургу – 200 руб. до 5000 руб,
          <br /><br />
          Челябинску – 250 руб до 5000 руб,
          <br /><br />
          Перми – 200 руб до 5000 руб,
          <br /><br />
          другим <span class="delivery__underline">100 городам России</span> -
          от 150 до 350 руб (точная стоимость доставки будет подсчитана в
          корзине). <br /><br />
          Стоимость доставки в Украину, Белоруссию и Казахстан составляет от 500
          руб и осуществляется почтой или ЕМС по 100% предоплате.
          <br /><br />
          Оформить заявку на покупку и доставку заказа Вы сможете через корзину
          круглосуточно (при этом менеджер магазина с вами свяжется для
          подтверждения заказа только в рабочее время магазина).
          <br /><br />
          Как правило, доставка осуществляется ПН-СБ с 14.00 до 21.00, на
          следующий день после оформления заказа. Если Вам нужна срочная
          доставка, свяжитесь с нами. Мы найдем способ, помочь Вам.
          <br /><br />
          При отказе от товара при доставке курьером, клиент оплачивает за
          курьерские услуги!
          <br /><br />
        </p>
        <Collapse title="Самовывоз">
          Как правило, доставка осуществляется ПН-СБ с 14.00 до 21.00, на
          следующий день после оформления заказа. Если Вам нужна срочная
          доставка, свяжитесь с нами. Мы найдем способ, помочь Вам.
          <br /><br />
          При отказе от товара при доставке курьером, клиент оплачивает за
          курьерские услуги!
        </Collapse>
        <Collapse title="Доставка в города и регионы России почтой или EMS">
          Как правило, доставка осуществляется ПН-СБ с 14.00 до 21.00, на
          следующий день после оформления заказа. Если Вам нужна срочная
          доставка, свяжитесь с нами. Мы найдем способ, помочь Вам.
          <br /><br />
          При отказе от товара при доставке курьером, клиент оплачивает за
          курьерские услуги!
        </Collapse>
        <Collapse title="Система скидок">
          Как правило, доставка осуществляется ПН-СБ с 14.00 до 21.00, на
          следующий день после оформления заказа. Если Вам нужна срочная
          доставка, свяжитесь с нами. Мы найдем способ, помочь Вам.
          <br /><br />
          При отказе от товара при доставке курьером, клиент оплачивает за
          курьерские услуги!
        </Collapse>
        <p class="delivery__small">
          *Бесплатная доставка осуществляется при условии достижения минимальной
          суммы заказа:
          <br /><br />
          - для Почты России - 10 000 руб
          <br /><br />
          - для EMS - 20 000 руб
          <br /><br />
          В города Крайнего Севера, Дальнего Востока, Казахстана, Белоруссии,
          Украины и других населенных пунктов за пределами РФ бесплатная
          доставка может быть не применима. Для дополнительной информации,
          обратитесь в наш интернет-магазин.
          <br /><br />
          **Предложение ограничено: товары, не участвующие в акции, уточняйте у
          менеджеров. Акция действует до 15.12.2020. Если расчетная стоимость
          доставки составляет более 490 руб, предоплата обязательна.
          <br /><br />
          ***Указанные тарифы действительны с 01.01.2018 г. Империя Kids не
          несёт ответственности за изменение данных тарифов.
        </p>
      </div>
      <PopularProducts />
    </div>
  </div>
</template>

<script>
import Breadcrumb from '@/components/BaseComponents/Breadcrumb'
import BreadcrumbContainer from '@/components/BaseComponents/BreadcrumbContainer'
import { isDesktop, isMobile, isTablet } from '@/store/display'
import Collapse from '@/components/BaseComponents/Collapse'
import PopularProducts from '@/components/Main/Delivery/PopularProducts'
export default {
  name: 'Delivery',
  components: {
    PopularProducts,
    Collapse,
    BreadcrumbContainer,
    Breadcrumb,
  },
  setup() {
    return {
      isTablet,
      isDesktop,
      isMobile,
    }
  },
}
</script>

<style scoped lang="scss">
.delivery {
  margin-bottom: 8px;
  &__header {
    font-size: 15.5px;
    font-weight: 500;
    line-height: 1.19;
    color: $text;
    margin-top: 0;
    margin-bottom: 18px;
    text-transform: uppercase;
  }
  &__content {
    padding: 25px 18px;
    p {
      font-size: 17px;
      line-height: 1.05;
      color: $text;
    }
  }

  &__underline {
    text-decoration: underline;
    font-weight: 600;
    color: #000;
  }
  &__small {
    font-size: 14px !important;
  }
}

@media (max-width: $media-mobile) {
  .delivery {
    &__content {
      padding: 25px 12px;
    }
  }
}
</style>
